// 1. 변수 선언과 할당
//     두 개의 변수 **`x`**와 **`y`**를 선언하고, 각각 숫자 10과 20을 할당하세요. 
//     그리고 두 변수를 더한 값을 새로운 변수 **`sum`**에 저장하고 **`sum`**의 값을 콘솔에 출력하세요.
let x = 10;
let y = 20;
let sum = x + y;
console.log(sum); // 30

// 2. 변수 재할당
//      변수 **`name`**에 "Alice"라는 값을 할당하세요.
//      이후 **`name`** 변수에 "Bob"이라는 값으로 재할당하세요.
//      **`name`** 변수의 최종 값을 콘솔에 출력하세요.
let name1 = "Alice";
name1 = "Bob";
console.log(name1); // Bob

// 3. 상수
//      상수 **`PI`**를 선언하고 값 3.14를 할당하세요.
//      **`PI`** 값을 콘솔에 출력하세요.
const PI = 3.14;
console.log(PI); // 3.14

