/**
 * 1. 리액트 스타일링 방법
 *
 * 1.1 전통적인 방법으로 스타일링 하기
 * 1.1.1 인라인 스타일
 * 1.1.2 글로벌(외부) 스타일
 * 1.1.3 CSS 모듈 (+ classnames 패키지)
 *
 * 1.2 CSS-IN-JS 방법으로 스타일링 하기
 * 1.2.1 styled-components
 * 1.2.2 emotion
 * 1.2.2.1 CSS를 런타임에 생성한다.
 * 1.2.2.2 그렇기 때문에 초기 로딩에 대한 오버헤드가 크다.
 * 1.2.3 Vanilla Extract (타입스크립트 완벽 지원 + 제로 런타임)
 *
 * 1.3 TailwindCSS 방법으로 스타일링 하기
 * 1.3.1 단독 유틸리티 퍼스트 CSS 라이브러리
 *
 * 1.4 그외
 * 1.4.1 이미지 렌더링하기
 * 1.4.1.1 public -> 파비콘, robots.txt, 구글 애널리틱스 인증 파일, 네이버 콘솔 인증
 * 1.4.1.2 src -> 대부분의 이미지는 src폴더에 넣는게 좋다.
 * 1.4.1.3 번들링 -> 리소스를 최적화(압축, 캐시)
 *
 * 1.4.2 폰트 적용하기
 */
